###################################################################

# Created by write_sdc on Mon Feb  3 15:26:31 2014

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_capacitance 150 [current_design]
set_max_fanout 20 [current_design]
set_max_transition 5 [current_design]
set_propagated_clock [get_ports clk]
create_clock [get_ports clk]  -name clock  -period 10  -waveform {0 5}
set_clock_gating_check -rise -setup 0 [get_cells                               \
regs/clk_gate_opcode_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
regs/clk_gate_opcode_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
regs/clk_gate_opcode_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
regs/clk_gate_opcode_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
regs/clk_gate_psr_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
regs/clk_gate_psr_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells regs/clk_gate_psr_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells regs/clk_gate_psr_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
regs/clk_gate_imem_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
regs/clk_gate_imem_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
regs/clk_gate_imem_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
regs/clk_gate_imem_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
regs/clk_gate_acc_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
regs/clk_gate_acc_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells regs/clk_gate_acc_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells regs/clk_gate_acc_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
pc/clk_gate_addr_out_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
pc/clk_gate_addr_out_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
pc/clk_gate_addr_out_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
pc/clk_gate_addr_out_reg/main_gate]
set_load -max 21.6211  [get_nets dmem_port_write]
set_load -min 18.3165  [get_nets dmem_port_write]
set_load -max 24.1137  [get_nets n6]
set_load -min 20.5321  [get_nets n6]
set_load -max 20.0646  [get_nets n7]
set_load -min 17.0348  [get_nets n7]
set_load -max 15.2776  [get_nets imem_update]
set_load -min 13.0412  [get_nets imem_update]
set_load -max 1.9716  [get_nets opcode_update]
set_load -min 1.67547  [get_nets opcode_update]
set_load -max 1.03013  [get_nets {opcode[7]}]
set_load -min 0.882642  [get_nets {opcode[7]}]
set_load -max 3.19049  [get_nets n2]
set_load -min 2.71459  [get_nets n2]
set_load -max 0.448847  [get_nets {opcode[5]}]
set_load -min 0.385635  [get_nets {opcode[5]}]
set_load -max 0.756258  [get_nets {opcode[4]}]
set_load -min 0.648872  [get_nets {opcode[4]}]
set_load -max 0.882508  [get_nets {opcode[3]}]
set_load -min 0.754436  [get_nets {opcode[3]}]
set_load -max 2.33056  [get_nets n4]
set_load -min 1.98258  [get_nets n4]
set_load -max 5.03753  [get_nets {opcode[1]}]
set_load -min 4.28379  [get_nets {opcode[1]}]
set_load -max 5.9602  [get_nets {opcode[0]}]
set_load -min 5.06125  [get_nets {opcode[0]}]
set_load -max 0.578995  [get_nets psr_update]
set_load -min 0.486406  [get_nets psr_update]
set_load -max 9.38179  [get_nets res_update]
set_load -min 7.98266  [get_nets res_update]
set_load -max 1.56702  [get_nets {res_sel[1]}]
set_load -min 1.32001  [get_nets {res_sel[1]}]
set_load -max 1.09228  [get_nets {res_sel[0]}]
set_load -min 0.918782  [get_nets {res_sel[0]}]
set_load -max 2.02455  [get_nets {opa_sel[1]}]
set_load -min 1.71853  [get_nets {opa_sel[1]}]
set_load -max 1.39035  [get_nets {opa_sel[0]}]
set_load -min 1.18679  [get_nets {opa_sel[0]}]
set_load -max 3.30595  [get_nets {opb_sel[1]}]
set_load -min 2.82039  [get_nets {opb_sel[1]}]
set_load -max 3.58271  [get_nets {opb_sel[0]}]
set_load -min 3.05261  [get_nets {opb_sel[0]}]
set_load -max 3.3555  [get_nets rst]
set_load -min 2.87914  [get_nets rst]
set_load -max 26.2003  [get_nets clk]
set_load -min 22.8673  [get_nets clk]
set_resistance 0.000132744  [get_nets clk]
set_load -max 3.53504  [get_nets {imem_data[7]}]
set_load -min 3.04233  [get_nets {imem_data[7]}]
set_load -max 6.9973  [get_nets {imem_data[6]}]
set_load -min 6.02408  [get_nets {imem_data[6]}]
set_load -max 6.91276  [get_nets {imem_data[5]}]
set_load -min 5.9646  [get_nets {imem_data[5]}]
set_load -max 4.5241  [get_nets {imem_data[4]}]
set_load -min 3.90521  [get_nets {imem_data[4]}]
set_load -max 4.72771  [get_nets {imem_data[3]}]
set_load -min 4.06335  [get_nets {imem_data[3]}]
set_load -max 7.0524  [get_nets {imem_data[2]}]
set_load -min 6.02236  [get_nets {imem_data[2]}]
set_load -max 9.0475  [get_nets {imem_data[1]}]
set_load -min 7.73187  [get_nets {imem_data[1]}]
set_load -max 10.5007  [get_nets {imem_data[0]}]
set_load -min 8.9528  [get_nets {imem_data[0]}]
set_load -max 11.8938  [get_nets {imem_addr[7]}]
set_load -min 10.1598  [get_nets {imem_addr[7]}]
set_load -max 10.7758  [get_nets {imem_addr[6]}]
set_load -min 9.19756  [get_nets {imem_addr[6]}]
set_load -max 9.54383  [get_nets {imem_addr[5]}]
set_load -min 8.17937  [get_nets {imem_addr[5]}]
set_load -max 9.98406  [get_nets {imem_addr[4]}]
set_load -min 8.5576  [get_nets {imem_addr[4]}]
set_load -max 13.8495  [get_nets {imem_addr[3]}]
set_load -min 11.8281  [get_nets {imem_addr[3]}]
set_load -max 12.9461  [get_nets {imem_addr[2]}]
set_load -min 11.0218  [get_nets {imem_addr[2]}]
set_load -max 15.4678  [get_nets {imem_addr[1]}]
set_load -min 13.132  [get_nets {imem_addr[1]}]
set_load -max 14.3077  [get_nets {imem_addr[0]}]
set_load -min 12.1767  [get_nets {imem_addr[0]}]
set_load -max 12.5727  [get_nets {dmem_port_value[7]}]
set_load -min 10.7629  [get_nets {dmem_port_value[7]}]
set_load -max 11.4467  [get_nets {dmem_port_value[6]}]
set_load -min 9.85008  [get_nets {dmem_port_value[6]}]
set_load -max 11.2835  [get_nets {dmem_port_value[5]}]
set_load -min 9.69533  [get_nets {dmem_port_value[5]}]
set_load -max 11.6596  [get_nets {dmem_port_value[4]}]
set_load -min 9.92189  [get_nets {dmem_port_value[4]}]
set_load -max 9.21605  [get_nets {dmem_port_value[3]}]
set_load -min 7.82064  [get_nets {dmem_port_value[3]}]
set_load -max 6.86407  [get_nets {dmem_port_value[2]}]
set_load -min 5.79873  [get_nets {dmem_port_value[2]}]
set_load -max 4.75156  [get_nets {dmem_port_value[1]}]
set_load -min 4.00038  [get_nets {dmem_port_value[1]}]
set_load -max 4.68465  [get_nets {dmem_port_value[0]}]
set_load -min 3.93723  [get_nets {dmem_port_value[0]}]
set_load -max 15.9752  [get_nets {dmem_port_addr[7]}]
set_load -min 13.4971  [get_nets {dmem_port_addr[7]}]
set_load -max 18.4084  [get_nets {dmem_port_addr[6]}]
set_load -min 15.5767  [get_nets {dmem_port_addr[6]}]
set_load -max 16.0104  [get_nets {dmem_port_addr[5]}]
set_load -min 13.5079  [get_nets {dmem_port_addr[5]}]
set_load -max 18.6269  [get_nets {dmem_port_addr[4]}]
set_load -min 15.7537  [get_nets {dmem_port_addr[4]}]
set_load -max 16.7489  [get_nets {dmem_port_addr[3]}]
set_load -min 14.1719  [get_nets {dmem_port_addr[3]}]
set_load -max 16.1642  [get_nets {dmem_port_addr[2]}]
set_load -min 13.7136  [get_nets {dmem_port_addr[2]}]
set_load -max 17.124  [get_nets {dmem_port_addr[1]}]
set_load -min 14.5487  [get_nets {dmem_port_addr[1]}]
set_load -max 14.8398  [get_nets {dmem_port_addr[0]}]
set_load -min 12.5654  [get_nets {dmem_port_addr[0]}]
set_load -max 17.6483  [get_nets {alu_operation[3]}]
set_load -min 14.9457  [get_nets {alu_operation[3]}]
set_load -max 9.78523  [get_nets {opb[7]}]
set_load -min 8.29277  [get_nets {opb[7]}]
set_load -max 8.64944  [get_nets {opb[6]}]
set_load -min 7.30369  [get_nets {opb[6]}]
set_load -max 6.24307  [get_nets {opb[5]}]
set_load -min 5.3308  [get_nets {opb[5]}]
set_load -max 6.80115  [get_nets {opb[4]}]
set_load -min 5.80478  [get_nets {opb[4]}]
set_load -max 5.73041  [get_nets {opb[3]}]
set_load -min 4.87413  [get_nets {opb[3]}]
set_load -max 4.92028  [get_nets {opb[2]}]
set_load -min 4.1631  [get_nets {opb[2]}]
set_load -max 6.64283  [get_nets {opb[1]}]
set_load -min 5.60095  [get_nets {opb[1]}]
set_load -max 4.65921  [get_nets n3]
set_load -min 3.93006  [get_nets n3]
set_load -max 12.5727  [get_nets {dmem_data[7]}]
set_load -min 10.7629  [get_nets {dmem_data[7]}]
set_load -max 11.4467  [get_nets {dmem_data[6]}]
set_load -min 9.85008  [get_nets {dmem_data[6]}]
set_load -max 11.2835  [get_nets {dmem_data[5]}]
set_load -min 9.69533  [get_nets {dmem_data[5]}]
set_load -max 11.6596  [get_nets {dmem_data[4]}]
set_load -min 9.92189  [get_nets {dmem_data[4]}]
set_load -max 9.21605  [get_nets {dmem_data[3]}]
set_load -min 7.82064  [get_nets {dmem_data[3]}]
set_load -max 6.86407  [get_nets {dmem_data[2]}]
set_load -min 5.79873  [get_nets {dmem_data[2]}]
set_load -max 4.75156  [get_nets {dmem_data[1]}]
set_load -min 4.00038  [get_nets {dmem_data[1]}]
set_load -max 4.68465  [get_nets {dmem_data[0]}]
set_load -min 3.93723  [get_nets {dmem_data[0]}]
set_load -max 15.9752  [get_nets {alu_result[7]}]
set_load -min 13.4971  [get_nets {alu_result[7]}]
set_load -max 18.4084  [get_nets {alu_result[6]}]
set_load -min 15.5767  [get_nets {alu_result[6]}]
set_load -max 16.0104  [get_nets {alu_result[5]}]
set_load -min 13.5079  [get_nets {alu_result[5]}]
set_load -max 18.6269  [get_nets {alu_result[4]}]
set_load -min 15.7537  [get_nets {alu_result[4]}]
set_load -max 16.7489  [get_nets {alu_result[3]}]
set_load -min 14.1719  [get_nets {alu_result[3]}]
set_load -max 16.1642  [get_nets {alu_result[2]}]
set_load -min 13.7136  [get_nets {alu_result[2]}]
set_load -max 17.124  [get_nets {alu_result[1]}]
set_load -min 14.5487  [get_nets {alu_result[1]}]
set_load -max 14.8398  [get_nets {alu_result[0]}]
set_load -min 12.5654  [get_nets {alu_result[0]}]
set_load -max 9.61249  [get_nets {alu_operation[2]}]
set_load -min 8.15214  [get_nets {alu_operation[2]}]
set_load -max 6.00572  [get_nets {alu_operation[1]}]
set_load -min 5.09329  [get_nets {alu_operation[1]}]
set_load -max 5.27972  [get_nets {alu_operation[0]}]
set_load -min 4.46418  [get_nets {alu_operation[0]}]
set_load -max 8.90883  [get_nets {opa[7]}]
set_load -min 7.54814  [get_nets {opa[7]}]
set_load -max 10.0005  [get_nets {opa[6]}]
set_load -min 8.43247  [get_nets {opa[6]}]
set_load -max 9.18359  [get_nets {opa[5]}]
set_load -min 7.74913  [get_nets {opa[5]}]
set_load -max 7.01971  [get_nets {opa[4]}]
set_load -min 5.92858  [get_nets {opa[4]}]
set_load -max 5.08046  [get_nets {opa[3]}]
set_load -min 4.27771  [get_nets {opa[3]}]
set_load -max 5.20306  [get_nets {opa[2]}]
set_load -min 4.40121  [get_nets {opa[2]}]
set_load -max 5.03028  [get_nets n1]
set_load -min 4.23516  [get_nets n1]
set_load -max 5.28108  [get_nets {opa[0]}]
set_load -min 4.44725  [get_nets {opa[0]}]
set_load -max 10.0273  [get_nets {psr[2]}]
set_load -min 8.54099  [get_nets {psr[2]}]
set_load -max 5.12838  [get_nets {psr[1]}]
set_load -min 4.34945  [get_nets {psr[1]}]
set_load -max 8.58661  [get_nets {psr[0]}]
set_load -min 7.30385  [get_nets {psr[0]}]
set_load -max 1.06403  [get_nets {apsr[2]}]
set_load -min 0.901981  [get_nets {apsr[2]}]
set_load -max 0.564756  [get_nets {apsr[1]}]
set_load -min 0.478098  [get_nets {apsr[1]}]
set_load -max 1.52869  [get_nets {apsr[0]}]
set_load -min 1.28579  [get_nets {apsr[0]}]
set_load -max 15.2776  [get_nets pc_count]
set_load -min 13.0412  [get_nets pc_count]
set_load -max 16.4165  [get_nets pc_load]
set_load -min 13.9233  [get_nets pc_load]
set_load -max 0.697699  [get_nets ram_port/n1]
set_load -min 0.590077  [get_nets ram_port/n1]
set_load -max 21.6211  [get_nets ram_port/drive_enable]
set_load -min 18.3165  [get_nets ram_port/drive_enable]
set_load -max 9.78523  [get_nets {ram_port/drive_value[7]}]
set_load -min 8.29277  [get_nets {ram_port/drive_value[7]}]
set_load -max 8.64944  [get_nets {ram_port/drive_value[6]}]
set_load -min 7.30369  [get_nets {ram_port/drive_value[6]}]
set_load -max 6.24307  [get_nets {ram_port/drive_value[5]}]
set_load -min 5.3308  [get_nets {ram_port/drive_value[5]}]
set_load -max 6.80115  [get_nets {ram_port/drive_value[4]}]
set_load -min 5.80478  [get_nets {ram_port/drive_value[4]}]
set_load -max 5.73041  [get_nets {ram_port/drive_value[3]}]
set_load -min 4.87413  [get_nets {ram_port/drive_value[3]}]
set_load -max 4.92028  [get_nets {ram_port/drive_value[2]}]
set_load -min 4.1631  [get_nets {ram_port/drive_value[2]}]
set_load -max 6.64283  [get_nets {ram_port/drive_value[1]}]
set_load -min 5.60095  [get_nets {ram_port/drive_value[1]}]
set_load -max 4.65921  [get_nets {ram_port/drive_value[0]}]
set_load -min 3.93006  [get_nets {ram_port/drive_value[0]}]
set_load -max 12.5727  [get_nets {ram_port/port_value[7]}]
set_load -min 10.7629  [get_nets {ram_port/port_value[7]}]
set_load -max 11.4467  [get_nets {ram_port/port_value[6]}]
set_load -min 9.85008  [get_nets {ram_port/port_value[6]}]
set_load -max 11.2835  [get_nets {ram_port/port_value[5]}]
set_load -min 9.69533  [get_nets {ram_port/port_value[5]}]
set_load -max 11.6596  [get_nets {ram_port/port_value[4]}]
set_load -min 9.92189  [get_nets {ram_port/port_value[4]}]
set_load -max 9.21605  [get_nets {ram_port/port_value[3]}]
set_load -min 7.82064  [get_nets {ram_port/port_value[3]}]
set_load -max 6.86407  [get_nets {ram_port/port_value[2]}]
set_load -min 5.79873  [get_nets {ram_port/port_value[2]}]
set_load -max 4.75156  [get_nets {ram_port/port_value[1]}]
set_load -min 4.00038  [get_nets {ram_port/port_value[1]}]
set_load -max 4.68465  [get_nets {ram_port/port_value[0]}]
set_load -min 3.93723  [get_nets {ram_port/port_value[0]}]
set_load -max 15.9752  [get_nets {ram_port/current_addr[7]}]
set_load -min 13.4971  [get_nets {ram_port/current_addr[7]}]
set_load -max 18.4084  [get_nets {ram_port/current_addr[6]}]
set_load -min 15.5767  [get_nets {ram_port/current_addr[6]}]
set_load -max 16.0104  [get_nets {ram_port/current_addr[5]}]
set_load -min 13.5079  [get_nets {ram_port/current_addr[5]}]
set_load -max 18.6269  [get_nets {ram_port/current_addr[4]}]
set_load -min 15.7537  [get_nets {ram_port/current_addr[4]}]
set_load -max 16.7489  [get_nets {ram_port/current_addr[3]}]
set_load -min 14.1719  [get_nets {ram_port/current_addr[3]}]
set_load -max 16.1642  [get_nets {ram_port/current_addr[2]}]
set_load -min 13.7136  [get_nets {ram_port/current_addr[2]}]
set_load -max 17.124  [get_nets {ram_port/current_addr[1]}]
set_load -min 14.5487  [get_nets {ram_port/current_addr[1]}]
set_load -max 14.8398  [get_nets {ram_port/current_addr[0]}]
set_load -min 12.5654  [get_nets {ram_port/current_addr[0]}]
set_load -max 10.1081  [get_nets alu/n23]
set_load -min 8.51476  [get_nets alu/n23]
set_load -max 10.5119  [get_nets alu/n24]
set_load -min 8.84908  [get_nets alu/n24]
set_load -max 1.24816  [get_nets alu/n171]
set_load -min 1.05489  [get_nets alu/n171]
set_load -max 1.46406  [get_nets alu/n172]
set_load -min 1.22621  [get_nets alu/n172]
set_load -max 0.580209  [get_nets alu/n173]
set_load -min 0.487369  [get_nets alu/n173]
set_load -max 0.754539  [get_nets alu/n174]
set_load -min 0.639874  [get_nets alu/n174]
set_load -max 2.1291  [get_nets alu/n175]
set_load -min 1.78768  [get_nets alu/n175]
set_load -max 3.4584  [get_nets alu/n176]
set_load -min 2.90186  [get_nets alu/n176]
set_load -max 0.907197  [get_nets alu/n177]
set_load -min 0.763159  [get_nets alu/n177]
set_load -max 3.32003  [get_nets alu/n178]
set_load -min 2.79756  [get_nets alu/n178]
set_load -max 1.04006  [get_nets alu/n179]
set_load -min 0.867691  [get_nets alu/n179]
set_load -max 0.996053  [get_nets alu/n180]
set_load -min 0.83863  [get_nets alu/n180]
set_load -max 1.51511  [get_nets alu/n181]
set_load -min 1.2642  [get_nets alu/n181]
set_load -max 1.11781  [get_nets alu/n182]
set_load -min 0.933111  [get_nets alu/n182]
set_load -max 0.730019  [get_nets alu/n183]
set_load -min 0.615704  [get_nets alu/n183]
set_load -max 1.19126  [get_nets alu/n184]
set_load -min 1.00531  [get_nets alu/n184]
set_load -max 2.60576  [get_nets alu/n185]
set_load -min 2.18146  [get_nets alu/n185]
set_load -max 2.35732  [get_nets alu/n186]
set_load -min 1.98227  [get_nets alu/n186]
set_load -max 1.42668  [get_nets alu/n187]
set_load -min 1.21585  [get_nets alu/n187]
set_load -max 2.67804  [get_nets alu/n188]
set_load -min 2.25349  [get_nets alu/n188]
set_load -max 0.889173  [get_nets alu/n189]
set_load -min 0.755313  [get_nets alu/n189]
set_load -max 1.02124  [get_nets alu/n190]
set_load -min 0.866237  [get_nets alu/n190]
set_load -max 2.11387  [get_nets alu/n191]
set_load -min 1.77732  [get_nets alu/n191]
set_load -max 1.81218  [get_nets alu/n192]
set_load -min 1.51711  [get_nets alu/n192]
set_load -max 0.799388  [get_nets alu/n193]
set_load -min 0.675876  [get_nets alu/n193]
set_load -max 1.48699  [get_nets alu/n194]
set_load -min 1.26245  [get_nets alu/n194]
set_load -max 7.52615  [get_nets alu/n196]
set_load -min 6.37086  [get_nets alu/n196]
set_load -max 11.8684  [get_nets alu/n197]
set_load -min 9.99947  [get_nets alu/n197]
set_load -max 7.8448  [get_nets alu/n198]
set_load -min 6.61895  [get_nets alu/n198]
set_load -max 3.98333  [get_nets alu/n199]
set_load -min 3.36208  [get_nets alu/n199]
set_load -max 1.14452  [get_nets alu/n200]
set_load -min 0.972719  [get_nets alu/n200]
set_load -max 7.65282  [get_nets alu/n202]
set_load -min 6.47023  [get_nets alu/n202]
set_load -max 1.07864  [get_nets alu/n203]
set_load -min 0.907753  [get_nets alu/n203]
set_load -max 0.661593  [get_nets alu/n131]
set_load -min 0.561357  [get_nets alu/n131]
set_load -max 2.55917  [get_nets alu/n132]
set_load -min 2.14961  [get_nets alu/n132]
set_load -max 1.20797  [get_nets alu/n133]
set_load -min 1.01507  [get_nets alu/n133]
set_load -max 0.648848  [get_nets alu/n134]
set_load -min 0.544837  [get_nets alu/n134]
set_load -max 3.36359  [get_nets alu/n135]
set_load -min 2.83529  [get_nets alu/n135]
set_load -max 0.814815  [get_nets alu/n136]
set_load -min 0.684855  [get_nets alu/n136]
set_load -max 0.517529  [get_nets alu/n137]
set_load -min 0.432367  [get_nets alu/n137]
set_load -max 1.58036  [get_nets alu/n138]
set_load -min 1.33609  [get_nets alu/n138]
set_load -max 0.584623  [get_nets alu/n139]
set_load -min 0.489929  [get_nets alu/n139]
set_load -max 1.02914  [get_nets alu/n140]
set_load -min 0.86563  [get_nets alu/n140]
set_load -max 2.9867  [get_nets alu/n141]
set_load -min 2.51266  [get_nets alu/n141]
set_load -max 6.75297  [get_nets alu/n142]
set_load -min 5.67051  [get_nets alu/n142]
set_load -max 1.98683  [get_nets alu/n144]
set_load -min 1.65815  [get_nets alu/n144]
set_load -max 3.14521  [get_nets alu/n145]
set_load -min 2.64793  [get_nets alu/n145]
set_load -max 2.06872  [get_nets alu/n146]
set_load -min 1.74287  [get_nets alu/n146]
set_load -max 3.0798  [get_nets alu/n147]
set_load -min 2.58753  [get_nets alu/n147]
set_load -max 1.26794  [get_nets alu/n148]
set_load -min 1.06304  [get_nets alu/n148]
set_load -max 1.14876  [get_nets alu/n149]
set_load -min 0.967177  [get_nets alu/n149]
set_load -max 0.704305  [get_nets alu/n150]
set_load -min 0.59141  [get_nets alu/n150]
set_load -max 1.74401  [get_nets alu/n151]
set_load -min 1.45936  [get_nets alu/n151]
set_load -max 0.779373  [get_nets alu/n152]
set_load -min 0.656635  [get_nets alu/n152]
set_load -max 1.8363  [get_nets alu/n153]
set_load -min 1.53755  [get_nets alu/n153]
set_load -max 0.678054  [get_nets alu/n154]
set_load -min 0.574783  [get_nets alu/n154]
set_load -max 2.56495  [get_nets alu/n155]
set_load -min 2.15313  [get_nets alu/n155]
set_load -max 2.47147  [get_nets alu/n156]
set_load -min 2.07156  [get_nets alu/n156]
set_load -max 1.70581  [get_nets alu/n157]
set_load -min 1.43369  [get_nets alu/n157]
set_load -max 2.0219  [get_nets alu/n158]
set_load -min 1.68979  [get_nets alu/n158]
set_load -max 1.44938  [get_nets alu/n159]
set_load -min 1.21406  [get_nets alu/n159]
set_load -max 0.665533  [get_nets alu/n160]
set_load -min 0.558537  [get_nets alu/n160]
set_load -max 1.09608  [get_nets alu/n161]
set_load -min 0.917654  [get_nets alu/n161]
set_load -max 1.33464  [get_nets alu/n162]
set_load -min 1.12458  [get_nets alu/n162]
set_load -max 0.499395  [get_nets alu/n163]
set_load -min 0.423256  [get_nets alu/n163]
set_load -max 0.965091  [get_nets alu/n164]
set_load -min 0.804722  [get_nets alu/n164]
set_load -max 2.36989  [get_nets alu/n165]
set_load -min 1.99501  [get_nets alu/n165]
set_load -max 2.58885  [get_nets alu/n166]
set_load -min 2.16235  [get_nets alu/n166]
set_load -max 1.05001  [get_nets alu/n167]
set_load -min 0.880288  [get_nets alu/n167]
set_load -max 3.26884  [get_nets alu/n168]
set_load -min 2.72994  [get_nets alu/n168]
set_load -max 1.60036  [get_nets alu/n169]
set_load -min 1.3355  [get_nets alu/n169]
set_load -max 0.887635  [get_nets alu/n170]
set_load -min 0.743318  [get_nets alu/n170]
set_load -max 0.713074  [get_nets alu/n96]
set_load -min 0.602896  [get_nets alu/n96]
set_load -max 1.26862  [get_nets alu/n97]
set_load -min 1.06039  [get_nets alu/n97]
set_load -max 3.48095  [get_nets alu/n98]
set_load -min 2.95202  [get_nets alu/n98]
set_load -max 2.24822  [get_nets alu/n99]
set_load -min 1.88251  [get_nets alu/n99]
set_load -max 1.61502  [get_nets alu/n100]
set_load -min 1.36277  [get_nets alu/n100]
set_load -max 1.05937  [get_nets alu/n101]
set_load -min 0.900205  [get_nets alu/n101]
set_load -max 2.86151  [get_nets alu/n102]
set_load -min 2.43882  [get_nets alu/n102]
set_load -max 2.18055  [get_nets alu/n103]
set_load -min 1.84976  [get_nets alu/n103]
set_load -max 1.58401  [get_nets alu/n104]
set_load -min 1.33965  [get_nets alu/n104]
set_load -max 1.23729  [get_nets alu/n105]
set_load -min 1.03141  [get_nets alu/n105]
set_load -max 2.71197  [get_nets alu/n106]
set_load -min 2.26151  [get_nets alu/n106]
set_load -max 0.865136  [get_nets alu/n107]
set_load -min 0.7236  [get_nets alu/n107]
set_load -max 1.1566  [get_nets alu/n108]
set_load -min 0.964952  [get_nets alu/n108]
set_load -max 2.17357  [get_nets alu/n109]
set_load -min 1.82994  [get_nets alu/n109]
set_load -max 2.03694  [get_nets alu/n110]
set_load -min 1.71215  [get_nets alu/n110]
set_load -max 2.55023  [get_nets alu/n111]
set_load -min 2.1533  [get_nets alu/n111]
set_load -max 0.803181  [get_nets alu/n112]
set_load -min 0.673201  [get_nets alu/n112]
set_load -max 0.537351  [get_nets alu/n113]
set_load -min 0.45131  [get_nets alu/n113]
set_load -max 1.01659  [get_nets alu/n114]
set_load -min 0.855425  [get_nets alu/n114]
set_load -max 4.91675  [get_nets alu/n115]
set_load -min 4.12361  [get_nets alu/n115]
set_load -max 1.90826  [get_nets alu/n116]
set_load -min 1.60066  [get_nets alu/n116]
set_load -max 1.17377  [get_nets alu/n117]
set_load -min 0.990833  [get_nets alu/n117]
set_load -max 1.94752  [get_nets alu/n118]
set_load -min 1.64319  [get_nets alu/n118]
set_load -max 1.21239  [get_nets alu/n119]
set_load -min 1.02407  [get_nets alu/n119]
set_load -max 0.708274  [get_nets alu/n120]
set_load -min 0.598696  [get_nets alu/n120]
set_load -max 1.90313  [get_nets alu/n121]
set_load -min 1.60639  [get_nets alu/n121]
set_load -max 0.842551  [get_nets alu/n123]
set_load -min 0.701749  [get_nets alu/n123]
set_load -max 1.55107  [get_nets alu/n124]
set_load -min 1.31589  [get_nets alu/n124]
set_load -max 9.05226  [get_nets alu/n125]
set_load -min 7.68229  [get_nets alu/n125]
set_load -max 2.03189  [get_nets alu/n126]
set_load -min 1.72207  [get_nets alu/n126]
set_load -max 3.29229  [get_nets alu/n127]
set_load -min 2.75759  [get_nets alu/n127]
set_load -max 3.81837  [get_nets alu/n128]
set_load -min 3.22127  [get_nets alu/n128]
set_load -max 1.81621  [get_nets alu/n129]
set_load -min 1.54595  [get_nets alu/n129]
set_load -max 0.786951  [get_nets alu/n130]
set_load -min 0.669078  [get_nets alu/n130]
set_load -max 0.647161  [get_nets alu/n51]
set_load -min 0.548035  [get_nets alu/n51]
set_load -max 0.536636  [get_nets alu/n52]
set_load -min 0.451135  [get_nets alu/n52]
set_load -max 1.25316  [get_nets alu/n53]
set_load -min 1.04664  [get_nets alu/n53]
set_load -max 1.09158  [get_nets alu/n54]
set_load -min 0.930378  [get_nets alu/n54]
set_load -max 0.345961  [get_nets alu/n56]
set_load -min 0.294607  [get_nets alu/n56]
set_load -max 0.694092  [get_nets alu/n57]
set_load -min 0.582555  [get_nets alu/n57]
set_load -max 0.903051  [get_nets alu/n59]
set_load -min 0.763783  [get_nets alu/n59]
set_load -max 1.28533  [get_nets alu/n60]
set_load -min 1.09159  [get_nets alu/n60]
set_load -max 0.89937  [get_nets alu/n61]
set_load -min 0.759394  [get_nets alu/n61]
set_load -max 3.3826  [get_nets alu/n62]
set_load -min 2.86038  [get_nets alu/n62]
set_load -max 0.91888  [get_nets alu/n63]
set_load -min 0.787336  [get_nets alu/n63]
set_load -max 1.4651  [get_nets alu/n64]
set_load -min 1.23773  [get_nets alu/n64]
set_load -max 0.489529  [get_nets alu/n65]
set_load -min 0.416829  [get_nets alu/n65]
set_load -max 1.20576  [get_nets alu/n66]
set_load -min 1.0194  [get_nets alu/n66]
set_load -max 1.06556  [get_nets alu/n67]
set_load -min 0.894781  [get_nets alu/n67]
set_load -max 0.73646  [get_nets alu/n68]
set_load -min 0.622007  [get_nets alu/n68]
set_load -max 0.493809  [get_nets alu/n69]
set_load -min 0.421455  [get_nets alu/n69]
set_load -max 2.65184  [get_nets alu/n70]
set_load -min 2.23932  [get_nets alu/n70]
set_load -max 0.616671  [get_nets alu/n71]
set_load -min 0.518757  [get_nets alu/n71]
set_load -max 0.606363  [get_nets alu/n72]
set_load -min 0.513677  [get_nets alu/n72]
set_load -max 1.34072  [get_nets alu/n73]
set_load -min 1.12916  [get_nets alu/n73]
set_load -max 1.01643  [get_nets alu/n74]
set_load -min 0.861008  [get_nets alu/n74]
set_load -max 6.56561  [get_nets alu/n77]
set_load -min 5.561  [get_nets alu/n77]
set_load -max 3.02439  [get_nets alu/n78]
set_load -min 2.56115  [get_nets alu/n78]
set_load -max 1.34136  [get_nets alu/n79]
set_load -min 1.15611  [get_nets alu/n79]
set_load -max 1.17196  [get_nets alu/n80]
set_load -min 0.990429  [get_nets alu/n80]
set_load -max 3.10848  [get_nets alu/n8]
set_load -min 2.60885  [get_nets alu/n8]
set_load -max 0.76666  [get_nets alu/n9]
set_load -min 0.646778  [get_nets alu/n9]
set_load -max 0.617252  [get_nets alu/n10]
set_load -min 0.521339  [get_nets alu/n10]
set_load -max 0.46941  [get_nets alu/n11]
set_load -min 0.394071  [get_nets alu/n11]
set_load -max 2.51526  [get_nets alu/n12]
set_load -min 2.11273  [get_nets alu/n12]
set_load -max 1.58691  [get_nets alu/n13]
set_load -min 1.34945  [get_nets alu/n13]
set_load -max 2.67115  [get_nets alu/n14]
set_load -min 2.27637  [get_nets alu/n14]
set_load -max 0.671371  [get_nets alu/n15]
set_load -min 0.572743  [get_nets alu/n15]
set_load -max 1.35738  [get_nets alu/n17]
set_load -min 1.13701  [get_nets alu/n17]
set_load -max 4.7166  [get_nets alu/n25]
set_load -min 3.97812  [get_nets alu/n25]
set_load -max 2.17042  [get_nets alu/n26]
set_load -min 1.82309  [get_nets alu/n26]
set_load -max 2.81365  [get_nets alu/n37]
set_load -min 2.37804  [get_nets alu/n37]
set_load -max 7.28617  [get_nets alu/n42]
set_load -min 6.15111  [get_nets alu/n42]
set_load -max 2.10401  [get_nets alu/n45]
set_load -min 1.78602  [get_nets alu/n45]
set_load -max 1.72053  [get_nets alu/n46]
set_load -min 1.45797  [get_nets alu/n46]
set_load -max 0.742137  [get_nets alu/n47]
set_load -min 0.622015  [get_nets alu/n47]
set_load -max 3.61802  [get_nets alu/n48]
set_load -min 3.08809  [get_nets alu/n48]
set_load -max 0.605427  [get_nets alu/n49]
set_load -min 0.508623  [get_nets alu/n49]
set_load -max 0.937384  [get_nets alu/n50]
set_load -min 0.79026  [get_nets alu/n50]
set_load -max 0.817131  [get_nets alu/N120]
set_load -min 0.690428  [get_nets alu/N120]
set_load -max 1.48626  [get_nets alu/N121]
set_load -min 1.2592  [get_nets alu/N121]
set_load -max 0.84575  [get_nets alu/DP_OP_36J1_125_9744_n16]
set_load -min 0.714552  [get_nets alu/DP_OP_36J1_125_9744_n16]
set_load -max 4.456  [get_nets alu/DP_OP_36J1_125_9744_n15]
set_load -min 3.71652  [get_nets alu/DP_OP_36J1_125_9744_n15]
set_load -max 1.86273  [get_nets alu/DP_OP_36J1_125_9744_n14]
set_load -min 1.56609  [get_nets alu/DP_OP_36J1_125_9744_n14]
set_load -max 0.634906  [get_nets alu/DP_OP_36J1_125_9744_n13]
set_load -min 0.54821  [get_nets alu/DP_OP_36J1_125_9744_n13]
set_load -max 1.73991  [get_nets alu/DP_OP_36J1_125_9744_n12]
set_load -min 1.50342  [get_nets alu/DP_OP_36J1_125_9744_n12]
set_load -max 2.09279  [get_nets alu/DP_OP_36J1_125_9744_n11]
set_load -min 1.76393  [get_nets alu/DP_OP_36J1_125_9744_n11]
set_load -max 2.1247  [get_nets alu/DP_OP_36J1_125_9744_n10]
set_load -min 1.78874  [get_nets alu/DP_OP_36J1_125_9744_n10]
set_load -max 1.4309  [get_nets alu/DP_OP_35J1_124_9704_n8]
set_load -min 1.19927  [get_nets alu/DP_OP_35J1_124_9704_n8]
set_load -max 1.017  [get_nets alu/DP_OP_35J1_124_9704_n7]
set_load -min 0.85193  [get_nets alu/DP_OP_35J1_124_9704_n7]
set_load -max 2.64583  [get_nets alu/DP_OP_35J1_124_9704_n6]
set_load -min 2.20861  [get_nets alu/DP_OP_35J1_124_9704_n6]
set_load -max 0.853359  [get_nets alu/DP_OP_35J1_124_9704_n5]
set_load -min 0.736261  [get_nets alu/DP_OP_35J1_124_9704_n5]
set_load -max 1.10711  [get_nets alu/DP_OP_35J1_124_9704_n4]
set_load -min 0.947621  [get_nets alu/DP_OP_35J1_124_9704_n4]
set_load -max 1.89776  [get_nets alu/DP_OP_35J1_124_9704_n3]
set_load -min 1.61357  [get_nets alu/DP_OP_35J1_124_9704_n3]
set_load -max 1.34052  [get_nets alu/DP_OP_35J1_124_9704_n2]
set_load -min 1.13247  [get_nets alu/DP_OP_35J1_124_9704_n2]
set_load -max 0.471401  [get_nets alu/add_x_1_n8]
set_load -min 0.395706  [get_nets alu/add_x_1_n8]
set_load -max 2.24081  [get_nets alu/add_x_1_n7]
set_load -min 1.86876  [get_nets alu/add_x_1_n7]
set_load -max 1.45012  [get_nets alu/add_x_1_n6]
set_load -min 1.21863  [get_nets alu/add_x_1_n6]
set_load -max 0.849204  [get_nets alu/add_x_1_n5]
set_load -min 0.723361  [get_nets alu/add_x_1_n5]
set_load -max 0.980846  [get_nets alu/add_x_1_n4]
set_load -min 0.841564  [get_nets alu/add_x_1_n4]
set_load -max 0.668853  [get_nets alu/add_x_1_n3]
set_load -min 0.575239  [get_nets alu/add_x_1_n3]
set_load -max 2.35103  [get_nets alu/add_x_1_n2]
set_load -min 1.98905  [get_nets alu/add_x_1_n2]
set_load -max 3.98004  [get_nets alu/n4]
set_load -min 3.37384  [get_nets alu/n4]
set_load -max 0.814886  [get_nets alu/n5]
set_load -min 0.683832  [get_nets alu/n5]
set_load -max 0.412146  [get_nets alu/n6]
set_load -min 0.350159  [get_nets alu/n6]
set_load -max 0.548647  [get_nets alu/n7]
set_load -min 0.461817  [get_nets alu/n7]
set_load -max 3.18505  [get_nets alu/N68]
set_load -min 2.68538  [get_nets alu/N68]
set_load -max 2.03708  [get_nets alu/N69]
set_load -min 1.72221  [get_nets alu/N69]
set_load -max 3.23388  [get_nets alu/N70]
set_load -min 2.71334  [get_nets alu/N70]
set_load -max 3.30262  [get_nets alu/N71]
set_load -min 2.75874  [get_nets alu/N71]
set_load -max 4.43347  [get_nets alu/N72]
set_load -min 3.72594  [get_nets alu/N72]
set_load -max 2.99104  [get_nets alu/N73]
set_load -min 2.51357  [get_nets alu/N73]
set_load -max 3.2733  [get_nets alu/N74]
set_load -min 2.75909  [get_nets alu/N74]
set_load -max 1.51253  [get_nets alu/N75]
set_load -min 1.28464  [get_nets alu/N75]
set_load -max 0.9778  [get_nets alu/N76]
set_load -min 0.826282  [get_nets alu/N76]
set_load -max 3.56909  [get_nets alu/N87]
set_load -min 2.99767  [get_nets alu/N87]
set_load -max 0.892191  [get_nets alu/N88]
set_load -min 0.751351  [get_nets alu/N88]
set_load -max 0.89711  [get_nets alu/N89]
set_load -min 0.7563  [get_nets alu/N89]
set_load -max 3.64347  [get_nets alu/N90]
set_load -min 3.0507  [get_nets alu/N90]
set_load -max 2.82882  [get_nets alu/N91]
set_load -min 2.39259  [get_nets alu/N91]
set_load -max 1.87095  [get_nets alu/N92]
set_load -min 1.57877  [get_nets alu/N92]
set_load -max 3.26485  [get_nets alu/N93]
set_load -min 2.75961  [get_nets alu/N93]
set_load -max 2.95465  [get_nets alu/N94]
set_load -min 2.49067  [get_nets alu/N94]
set_load -max 1.47474  [get_nets alu/N95]
set_load -min 1.2425  [get_nets alu/N95]
set_load -max 4.79719  [get_nets alu/N97]
set_load -min 4.0587  [get_nets alu/N97]
set_load -max 4.6033  [get_nets alu/N98]
set_load -min 3.87385  [get_nets alu/N98]
set_load -max 7.31576  [get_nets alu/N99]
set_load -min 6.12947  [get_nets alu/N99]
set_load -max 8.66478  [get_nets alu/N100]
set_load -min 7.25895  [get_nets alu/N100]
set_load -max 9.49733  [get_nets alu/N101]
set_load -min 8.03058  [get_nets alu/N101]
set_load -max 7.94843  [get_nets alu/N102]
set_load -min 6.72335  [get_nets alu/N102]
set_load -max 4.58623  [get_nets alu/N103]
set_load -min 3.87197  [get_nets alu/N103]
set_load -max 2.58631  [get_nets alu/N104]
set_load -min 2.20024  [get_nets alu/N104]
set_load -max 2.17635  [get_nets alu/N114]
set_load -min 1.84973  [get_nets alu/N114]
set_load -max 1.07238  [get_nets alu/N115]
set_load -min 0.897652  [get_nets alu/N115]
set_load -max 1.01878  [get_nets alu/N116]
set_load -min 0.852121  [get_nets alu/N116]
set_load -max 1.25209  [get_nets alu/N117]
set_load -min 1.05833  [get_nets alu/N117]
set_load -max 1.40859  [get_nets alu/N118]
set_load -min 1.19985  [get_nets alu/N118]
set_load -max 1.62412  [get_nets alu/N119]
set_load -min 1.38501  [get_nets alu/N119]
set_load -max 17.6483  [get_nets {alu/operation[3]}]
set_load -min 14.9457  [get_nets {alu/operation[3]}]
set_load -max 9.61249  [get_nets {alu/operation[2]}]
set_load -min 8.15214  [get_nets {alu/operation[2]}]
set_load -max 6.00572  [get_nets {alu/operation[1]}]
set_load -min 5.09329  [get_nets {alu/operation[1]}]
set_load -max 5.27972  [get_nets {alu/operation[0]}]
set_load -min 4.46418  [get_nets {alu/operation[0]}]
set_load -max 8.90883  [get_nets {alu/a_i[7]}]
set_load -min 7.54814  [get_nets {alu/a_i[7]}]
set_load -max 10.0005  [get_nets {alu/a_i[6]}]
set_load -min 8.43247  [get_nets {alu/a_i[6]}]
set_load -max 9.18359  [get_nets {alu/a_i[5]}]
set_load -min 7.74913  [get_nets {alu/a_i[5]}]
set_load -max 7.01971  [get_nets {alu/a_i[4]}]
set_load -min 5.92858  [get_nets {alu/a_i[4]}]
set_load -max 5.08046  [get_nets {alu/a_i[3]}]
set_load -min 4.27771  [get_nets {alu/a_i[3]}]
set_load -max 5.20306  [get_nets {alu/a_i[2]}]
set_load -min 4.40121  [get_nets {alu/a_i[2]}]
set_load -max 5.03028  [get_nets {alu/a_i[1]}]
set_load -min 4.23516  [get_nets {alu/a_i[1]}]
set_load -max 5.28108  [get_nets {alu/a_i[0]}]
set_load -min 4.44725  [get_nets {alu/a_i[0]}]
set_load -max 9.78523  [get_nets {alu/b_i[7]}]
set_load -min 8.29277  [get_nets {alu/b_i[7]}]
set_load -max 8.64944  [get_nets {alu/b_i[6]}]
set_load -min 7.30369  [get_nets {alu/b_i[6]}]
set_load -max 6.24307  [get_nets {alu/b_i[5]}]
set_load -min 5.3308  [get_nets {alu/b_i[5]}]
set_load -max 6.80115  [get_nets {alu/b_i[4]}]
set_load -min 5.80478  [get_nets {alu/b_i[4]}]
set_load -max 5.73041  [get_nets {alu/b_i[3]}]
set_load -min 4.87413  [get_nets {alu/b_i[3]}]
set_load -max 4.92028  [get_nets {alu/b_i[2]}]
set_load -min 4.1631  [get_nets {alu/b_i[2]}]
set_load -max 6.64283  [get_nets {alu/b_i[1]}]
set_load -min 5.60095  [get_nets {alu/b_i[1]}]
set_load -max 4.65921  [get_nets {alu/b_i[0]}]
set_load -min 3.93006  [get_nets {alu/b_i[0]}]
set_load -max 10.0273  [get_nets {alu/psr[2]}]
set_load -min 8.54099  [get_nets {alu/psr[2]}]
set_load -max 5.12838  [get_nets {alu/psr[1]}]
set_load -min 4.34945  [get_nets {alu/psr[1]}]
set_load -max 8.58661  [get_nets {alu/psr[0]}]
set_load -min 7.30385  [get_nets {alu/psr[0]}]
set_load -max 15.9752  [get_nets {alu/result[7]}]
set_load -min 13.4971  [get_nets {alu/result[7]}]
set_load -max 18.4084  [get_nets {alu/result[6]}]
set_load -min 15.5767  [get_nets {alu/result[6]}]
set_load -max 16.0104  [get_nets {alu/result[5]}]
set_load -min 13.5079  [get_nets {alu/result[5]}]
set_load -max 18.6269  [get_nets {alu/result[4]}]
set_load -min 15.7537  [get_nets {alu/result[4]}]
set_load -max 16.7489  [get_nets {alu/result[3]}]
set_load -min 14.1719  [get_nets {alu/result[3]}]
set_load -max 16.1642  [get_nets {alu/result[2]}]
set_load -min 13.7136  [get_nets {alu/result[2]}]
set_load -max 17.124  [get_nets {alu/result[1]}]
set_load -min 14.5487  [get_nets {alu/result[1]}]
set_load -max 14.8398  [get_nets {alu/result[0]}]
set_load -min 12.5654  [get_nets {alu/result[0]}]
set_load -max 1.06403  [get_nets {alu/apsr[2]}]
set_load -min 0.901981  [get_nets {alu/apsr[2]}]
set_load -max 0.564756  [get_nets {alu/apsr[1]}]
set_load -min 0.478098  [get_nets {alu/apsr[1]}]
set_load -max 1.52869  [get_nets {alu/apsr[0]}]
set_load -min 1.28579  [get_nets {alu/apsr[0]}]
set_load -max 1.20344  [get_nets pc/n31]
set_load -min 1.02697  [get_nets pc/n31]
set_load -max 1.23611  [get_nets pc/n32]
set_load -min 1.05221  [get_nets pc/n32]
set_load -max 2.26897  [get_nets pc/n33]
set_load -min 1.95783  [get_nets pc/n33]
set_load -max 2.14867  [get_nets pc/n34]
set_load -min 1.82309  [get_nets pc/n34]
set_load -max 1.35052  [get_nets pc/n35]
set_load -min 1.1504  [get_nets pc/n35]
set_load -max 1.18249  [get_nets pc/n36]
set_load -min 1.01225  [get_nets pc/n36]
set_load -max 6.04943  [get_nets pc/n37]
set_load -min 5.10767  [get_nets pc/n37]
set_load -max 0.664192  [get_nets pc/N13]
set_load -min 0.558001  [get_nets pc/N13]
set_load -max 0.9274  [get_nets pc/N14]
set_load -min 0.784239  [get_nets pc/N14]
set_load -max 1.51002  [get_nets pc/N15]
set_load -min 1.29211  [get_nets pc/N15]
set_load -max 1.44616  [get_nets pc/N16]
set_load -min 1.2432  [get_nets pc/N16]
set_load -max 1.6182  [get_nets pc/N17]
set_load -min 1.3857  [get_nets pc/N17]
set_load -max 0.626265  [get_nets pc/N18]
set_load -min 0.538556  [get_nets pc/N18]
set_load -max 1.82199  [get_nets pc/N19]
set_load -min 1.5621  [get_nets pc/N19]
set_load -max 1.71627  [get_nets pc/N20]
set_load -min 1.47513  [get_nets pc/N20]
set_load -max 0.613051  [get_nets pc/n2]
set_load -min 0.515236  [get_nets pc/n2]
set_load -max 11.8226  [get_nets pc/n7]
set_load -min 10.1117  [get_nets pc/n7]
set_load -max 1.0103  [get_nets pc/n13]
set_load -min 0.86268  [get_nets pc/n13]
set_load -max 1.51448  [get_nets pc/n17]
set_load -min 1.30204  [get_nets pc/n17]
set_load -max 1.07971  [get_nets pc/n21]
set_load -min 0.925731  [get_nets pc/n21]
set_load -max 1.35723  [get_nets pc/n22]
set_load -min 1.15581  [get_nets pc/n22]
set_load -max 0.785146  [get_nets pc/n23]
set_load -min 0.668646  [get_nets pc/n23]
set_load -max 0.798349  [get_nets pc/n24]
set_load -min 0.67599  [get_nets pc/n24]
set_load -max 9.68819  [get_nets pc/n25]
set_load -min 8.27545  [get_nets pc/n25]
set_load -max 13.0284  [get_nets pc/n26]
set_load -min 11.1224  [get_nets pc/n26]
set_load -max 1.36622  [get_nets pc/n27]
set_load -min 1.1495  [get_nets pc/n27]
set_load -max 2.25239  [get_nets pc/n28]
set_load -min 1.94127  [get_nets pc/n28]
set_load -max 1.97567  [get_nets pc/n29]
set_load -min 1.70606  [get_nets pc/n29]
set_load -max 20.0646  [get_nets pc/rst]
set_load -min 17.0348  [get_nets pc/rst]
set_load -max 10.7758  [get_nets {pc/addr_out[6]}]
set_load -min 9.19756  [get_nets {pc/addr_out[6]}]
set_load -max 9.54383  [get_nets {pc/addr_out[5]}]
set_load -min 8.17937  [get_nets {pc/addr_out[5]}]
set_load -max 9.98406  [get_nets {pc/addr_out[4]}]
set_load -min 8.5576  [get_nets {pc/addr_out[4]}]
set_load -max 12.9461  [get_nets {pc/addr_out[2]}]
set_load -min 11.0218  [get_nets {pc/addr_out[2]}]
set_load -max 15.4678  [get_nets {pc/addr_out[1]}]
set_load -min 13.132  [get_nets {pc/addr_out[1]}]
set_load -max 14.3077  [get_nets {pc/addr_out[0]}]
set_load -min 12.1767  [get_nets {pc/addr_out[0]}]
set_load -max 18.6269  [get_nets {pc/addr_in[4]}]
set_load -min 15.7537  [get_nets {pc/addr_in[4]}]
set_load -max 16.7489  [get_nets {pc/addr_in[3]}]
set_load -min 14.1719  [get_nets {pc/addr_in[3]}]
set_load -max 16.1642  [get_nets {pc/addr_in[2]}]
set_load -min 13.7136  [get_nets {pc/addr_in[2]}]
set_load -max 17.124  [get_nets {pc/addr_in[1]}]
set_load -min 14.5487  [get_nets {pc/addr_in[1]}]
set_load -max 14.8398  [get_nets {pc/addr_in[0]}]
set_load -min 12.5654  [get_nets {pc/addr_in[0]}]
set_load -max 11.8938  [get_nets {pc/addr_out[7]}]
set_load -min 10.1598  [get_nets {pc/addr_out[7]}]
set_load -max 13.8495  [get_nets {pc/addr_out[3]}]
set_load -min 11.8281  [get_nets {pc/addr_out[3]}]
set_load -max 0.622826  [get_nets pc/N3]
set_load -min 0.5316  [get_nets pc/N3]
set_load -max 11.9227  [get_nets pc/net350]
set_load -min 10.3004  [get_nets pc/net350]
set_resistance 7.11169e-05  [get_nets pc/net350]
set_load -max 26.2003  [get_nets pc/clk]
set_load -min 22.8673  [get_nets pc/clk]
set_resistance 0.000132744  [get_nets pc/clk]
set_load -max 15.2776  [get_nets pc/count_BAR]
set_load -min 13.0412  [get_nets pc/count_BAR]
set_load -max 16.4165  [get_nets pc/load]
set_load -min 13.9233  [get_nets pc/load]
set_load -max 15.9752  [get_nets {pc/addr_in[7]}]
set_load -min 13.4971  [get_nets {pc/addr_in[7]}]
set_load -max 18.4084  [get_nets {pc/addr_in[6]}]
set_load -min 15.5767  [get_nets {pc/addr_in[6]}]
set_load -max 16.0104  [get_nets {pc/addr_in[5]}]
set_load -min 13.5079  [get_nets {pc/addr_in[5]}]
set_load -max 5.74638  [get_nets regs/n57]
set_load -min 4.83612  [get_nets regs/n57]
set_load -max 2.21409  [get_nets regs/n20]
set_load -min 1.8672  [get_nets regs/n20]
set_load -max 7.44588  [get_nets regs/n21]
set_load -min 6.32709  [get_nets regs/n21]
set_load -max 7.63048  [get_nets regs/n22]
set_load -min 6.46006  [get_nets regs/n22]
set_load -max 8.16385  [get_nets regs/n23]
set_load -min 6.94574  [get_nets regs/n23]
set_load -max 0.870357  [get_nets regs/n24]
set_load -min 0.729426  [get_nets regs/n24]
set_load -max 0.489404  [get_nets regs/n25]
set_load -min 0.409402  [get_nets regs/n25]
set_load -max 0.358019  [get_nets regs/n26]
set_load -min 0.299162  [get_nets regs/n26]
set_load -max 0.534425  [get_nets regs/n27]
set_load -min 0.446106  [get_nets regs/n27]
set_load -max 1.85448  [get_nets regs/n28]
set_load -min 1.57157  [get_nets regs/n28]
set_load -max 1.021  [get_nets regs/n29]
set_load -min 0.868732  [get_nets regs/n29]
set_load -max 0.572113  [get_nets regs/n30]
set_load -min 0.485028  [get_nets regs/n30]
set_load -max 1.03199  [get_nets regs/n31]
set_load -min 0.876748  [get_nets regs/n31]
set_load -max 1.67132  [get_nets regs/n32]
set_load -min 1.40335  [get_nets regs/n32]
set_load -max 0.377296  [get_nets regs/n33]
set_load -min 0.322443  [get_nets regs/n33]
set_load -max 1.50984  [get_nets regs/n34]
set_load -min 1.28586  [get_nets regs/n34]
set_load -max 0.847532  [get_nets regs/n35]
set_load -min 0.721595  [get_nets regs/n35]
set_load -max 7.18052  [get_nets regs/n36]
set_load -min 6.04221  [get_nets regs/n36]
set_load -max 7.14695  [get_nets regs/n37]
set_load -min 6.02248  [get_nets regs/n37]
set_load -max 7.03514  [get_nets regs/n38]
set_load -min 5.91128  [get_nets regs/n38]
set_load -max 1.36378  [get_nets regs/n39]
set_load -min 1.14572  [get_nets regs/n39]
set_load -max 1.21079  [get_nets regs/n40]
set_load -min 1.01706  [get_nets regs/n40]
set_load -max 1.38896  [get_nets regs/n41]
set_load -min 1.16863  [get_nets regs/n41]
set_load -max 0.88531  [get_nets regs/n42]
set_load -min 0.755349  [get_nets regs/n42]
set_load -max 1.53661  [get_nets regs/n43]
set_load -min 1.30615  [get_nets regs/n43]
set_load -max 0.368183  [get_nets regs/n44]
set_load -min 0.311484  [get_nets regs/n44]
set_load -max 0.397319  [get_nets regs/n45]
set_load -min 0.338207  [get_nets regs/n45]
set_load -max 0.688464  [get_nets regs/n46]
set_load -min 0.582793  [get_nets regs/n46]
set_load -max 0.819597  [get_nets regs/n47]
set_load -min 0.689943  [get_nets regs/n47]
set_load -max 0.640592  [get_nets regs/n48]
set_load -min 0.545537  [get_nets regs/n48]
set_load -max 0.959129  [get_nets regs/n49]
set_load -min 0.804466  [get_nets regs/n49]
set_load -max 0.727332  [get_nets regs/n50]
set_load -min 0.614039  [get_nets regs/n50]
set_load -max 0.440946  [get_nets regs/n51]
set_load -min 0.373232  [get_nets regs/n51]
set_load -max 0.73529  [get_nets regs/n52]
set_load -min 0.613596  [get_nets regs/n52]
set_load -max 1.18101  [get_nets regs/n53]
set_load -min 1.00123  [get_nets regs/n53]
set_load -max 0.610064  [get_nets regs/n54]
set_load -min 0.506469  [get_nets regs/n54]
set_load -max 5.80629  [get_nets regs/n55]
set_load -min 4.86836  [get_nets regs/n55]
set_load -max 6.31531  [get_nets regs/n56]
set_load -min 5.33456  [get_nets regs/n56]
set_load -max 4.1068  [get_nets {regs/imem[7]}]
set_load -min 3.5166  [get_nets {regs/imem[7]}]
set_load -max 4.09402  [get_nets {regs/imem[6]}]
set_load -min 3.50414  [get_nets {regs/imem[6]}]
set_load -max 4.67824  [get_nets {regs/imem[5]}]
set_load -min 3.99323  [get_nets {regs/imem[5]}]
set_load -max 3.28983  [get_nets {regs/imem[4]}]
set_load -min 2.84069  [get_nets {regs/imem[4]}]
set_load -max 2.70172  [get_nets {regs/imem[3]}]
set_load -min 2.30595  [get_nets {regs/imem[3]}]
set_load -max 3.69442  [get_nets {regs/imem[2]}]
set_load -min 3.16712  [get_nets {regs/imem[2]}]
set_load -max 4.23689  [get_nets {regs/imem[1]}]
set_load -min 3.61382  [get_nets {regs/imem[1]}]
set_load -max 3.9071  [get_nets {regs/imem[0]}]
set_load -min 3.33658  [get_nets {regs/imem[0]}]
set_load -max 2.03369  [get_nets {regs/acc[7]}]
set_load -min 1.73214  [get_nets {regs/acc[7]}]
set_load -max 2.70712  [get_nets {regs/acc[6]}]
set_load -min 2.29327  [get_nets {regs/acc[6]}]
set_load -max 1.85266  [get_nets {regs/acc[5]}]
set_load -min 1.57351  [get_nets {regs/acc[5]}]
set_load -max 2.13731  [get_nets {regs/acc[4]}]
set_load -min 1.82351  [get_nets {regs/acc[4]}]
set_load -max 1.35898  [get_nets {regs/acc[3]}]
set_load -min 1.14605  [get_nets {regs/acc[3]}]
set_load -max 1.32247  [get_nets {regs/acc[2]}]
set_load -min 1.12901  [get_nets {regs/acc[2]}]
set_load -max 1.93919  [get_nets {regs/acc[1]}]
set_load -min 1.64649  [get_nets {regs/acc[1]}]
set_load -max 1.11994  [get_nets {regs/acc[0]}]
set_load -min 0.940836  [get_nets {regs/acc[0]}]
set_load -max 0.627012  [get_nets regs/N19]
set_load -min 0.52816  [get_nets regs/N19]
set_load -max 0.428288  [get_nets regs/N20]
set_load -min 0.362374  [get_nets regs/N20]
set_load -max 0.286214  [get_nets regs/N21]
set_load -min 0.240965  [get_nets regs/N21]
set_load -max 1.90209  [get_nets regs/N22]
set_load -min 1.62458  [get_nets regs/N22]
set_load -max 0.35173  [get_nets regs/N23]
set_load -min 0.301847  [get_nets regs/N23]
set_load -max 1.09182  [get_nets regs/N24]
set_load -min 0.923721  [get_nets regs/N24]
set_load -max 0.997675  [get_nets regs/N25]
set_load -min 0.848848  [get_nets regs/N25]
set_load -max 1.01636  [get_nets regs/N26]
set_load -min 0.857732  [get_nets regs/N26]
set_load -max 1.03515  [get_nets regs/n2]
set_load -min 0.864336  [get_nets regs/n2]
set_load -max 0.74096  [get_nets regs/n5]
set_load -min 0.628507  [get_nets regs/n5]
set_load -max 1.32173  [get_nets regs/n6]
set_load -min 1.12063  [get_nets regs/n6]
set_load -max 0.495461  [get_nets regs/n7]
set_load -min 0.422512  [get_nets regs/n7]
set_load -max 1.31646  [get_nets regs/n8]
set_load -min 1.12177  [get_nets regs/n8]
set_load -max 0.612426  [get_nets regs/n9]
set_load -min 0.524825  [get_nets regs/n9]
set_load -max 0.666924  [get_nets regs/n10]
set_load -min 0.572123  [get_nets regs/n10]
set_load -max 0.560968  [get_nets regs/n11]
set_load -min 0.479696  [get_nets regs/n11]
set_load -max 0.595746  [get_nets regs/n12]
set_load -min 0.50279  [get_nets regs/n12]
set_load -max 0.568669  [get_nets regs/n13]
set_load -min 0.482703  [get_nets regs/n13]
set_load -max 0.681593  [get_nets regs/n14]
set_load -min 0.572964  [get_nets regs/n14]
set_load -max 20.0646  [get_nets regs/rst]
set_load -min 17.0348  [get_nets regs/rst]
set_load -max 3.19049  [get_nets {regs/opcode[6]}]
set_load -min 2.71459  [get_nets {regs/opcode[6]}]
set_load -max 2.33056  [get_nets {regs/opcode[2]}]
set_load -min 1.98258  [get_nets {regs/opcode[2]}]
set_load -max 24.1137  [get_nets regs/IN0]
set_load -min 20.5321  [get_nets regs/IN0]
set_load -max 26.2003  [get_nets regs/clk]
set_load -min 22.8673  [get_nets regs/clk]
set_resistance 0.000132744  [get_nets regs/clk]
set_load -max 12.5727  [get_nets {regs/dmem_data[7]}]
set_load -min 10.7629  [get_nets {regs/dmem_data[7]}]
set_load -max 11.4467  [get_nets {regs/dmem_data[6]}]
set_load -min 9.85008  [get_nets {regs/dmem_data[6]}]
set_load -max 11.2835  [get_nets {regs/dmem_data[5]}]
set_load -min 9.69533  [get_nets {regs/dmem_data[5]}]
set_load -max 11.6596  [get_nets {regs/dmem_data[4]}]
set_load -min 9.92189  [get_nets {regs/dmem_data[4]}]
set_load -max 9.21605  [get_nets {regs/dmem_data[3]}]
set_load -min 7.82064  [get_nets {regs/dmem_data[3]}]
set_load -max 6.86407  [get_nets {regs/dmem_data[2]}]
set_load -min 5.79873  [get_nets {regs/dmem_data[2]}]
set_load -max 4.75156  [get_nets {regs/dmem_data[1]}]
set_load -min 4.00038  [get_nets {regs/dmem_data[1]}]
set_load -max 4.68465  [get_nets {regs/dmem_data[0]}]
set_load -min 3.93723  [get_nets {regs/dmem_data[0]}]
set_load -max 15.2776  [get_nets regs/imem_update]
set_load -min 13.0412  [get_nets regs/imem_update]
set_load -max 3.53504  [get_nets {regs/imem_data[7]}]
set_load -min 3.04233  [get_nets {regs/imem_data[7]}]
set_load -max 6.9973  [get_nets {regs/imem_data[6]}]
set_load -min 6.02408  [get_nets {regs/imem_data[6]}]
set_load -max 6.91276  [get_nets {regs/imem_data[5]}]
set_load -min 5.9646  [get_nets {regs/imem_data[5]}]
set_load -max 4.5241  [get_nets {regs/imem_data[4]}]
set_load -min 3.90521  [get_nets {regs/imem_data[4]}]
set_load -max 4.72771  [get_nets {regs/imem_data[3]}]
set_load -min 4.06335  [get_nets {regs/imem_data[3]}]
set_load -max 7.0524  [get_nets {regs/imem_data[2]}]
set_load -min 6.02236  [get_nets {regs/imem_data[2]}]
set_load -max 9.0475  [get_nets {regs/imem_data[1]}]
set_load -min 7.73187  [get_nets {regs/imem_data[1]}]
set_load -max 10.5007  [get_nets {regs/imem_data[0]}]
set_load -min 8.9528  [get_nets {regs/imem_data[0]}]
set_load -max 1.9716  [get_nets regs/opcode_update]
set_load -min 1.67547  [get_nets regs/opcode_update]
set_load -max 1.03013  [get_nets {regs/opcode[7]}]
set_load -min 0.882642  [get_nets {regs/opcode[7]}]
set_load -max 0.448847  [get_nets {regs/opcode[5]}]
set_load -min 0.385635  [get_nets {regs/opcode[5]}]
set_load -max 0.756258  [get_nets {regs/opcode[4]}]
set_load -min 0.648872  [get_nets {regs/opcode[4]}]
set_load -max 0.882508  [get_nets {regs/opcode[3]}]
set_load -min 0.754436  [get_nets {regs/opcode[3]}]
set_load -max 5.03753  [get_nets {regs/opcode[1]}]
set_load -min 4.28379  [get_nets {regs/opcode[1]}]
set_load -max 5.9602  [get_nets {regs/opcode[0]}]
set_load -min 5.06125  [get_nets {regs/opcode[0]}]
set_load -max 0.578995  [get_nets regs/psr_update]
set_load -min 0.486406  [get_nets regs/psr_update]
set_load -max 1.06403  [get_nets {regs/apsr[2]}]
set_load -min 0.901981  [get_nets {regs/apsr[2]}]
set_load -max 0.564756  [get_nets {regs/apsr[1]}]
set_load -min 0.478098  [get_nets {regs/apsr[1]}]
set_load -max 1.52869  [get_nets {regs/apsr[0]}]
set_load -min 1.28579  [get_nets {regs/apsr[0]}]
set_load -max 10.0273  [get_nets {regs/psr[2]}]
set_load -min 8.54099  [get_nets {regs/psr[2]}]
set_load -max 5.12838  [get_nets {regs/psr[1]}]
set_load -min 4.34945  [get_nets {regs/psr[1]}]
set_load -max 8.58661  [get_nets {regs/psr[0]}]
set_load -min 7.30385  [get_nets {regs/psr[0]}]
set_load -max 9.38179  [get_nets regs/res_update]
set_load -min 7.98266  [get_nets regs/res_update]
set_load -max 1.56702  [get_nets {regs/res_sel[1]}]
set_load -min 1.32001  [get_nets {regs/res_sel[1]}]
set_load -max 1.09228  [get_nets {regs/res_sel[0]}]
set_load -min 0.918782  [get_nets {regs/res_sel[0]}]
set_load -max 15.9752  [get_nets {regs/alu[7]}]
set_load -min 13.4971  [get_nets {regs/alu[7]}]
set_load -max 18.4084  [get_nets {regs/alu[6]}]
set_load -min 15.5767  [get_nets {regs/alu[6]}]
set_load -max 16.0104  [get_nets {regs/alu[5]}]
set_load -min 13.5079  [get_nets {regs/alu[5]}]
set_load -max 18.6269  [get_nets {regs/alu[4]}]
set_load -min 15.7537  [get_nets {regs/alu[4]}]
set_load -max 16.7489  [get_nets {regs/alu[3]}]
set_load -min 14.1719  [get_nets {regs/alu[3]}]
set_load -max 16.1642  [get_nets {regs/alu[2]}]
set_load -min 13.7136  [get_nets {regs/alu[2]}]
set_load -max 17.124  [get_nets {regs/alu[1]}]
set_load -min 14.5487  [get_nets {regs/alu[1]}]
set_load -max 14.8398  [get_nets {regs/alu[0]}]
set_load -min 12.5654  [get_nets {regs/alu[0]}]
set_load -max 2.02455  [get_nets {regs/opa_sel[1]}]
set_load -min 1.71853  [get_nets {regs/opa_sel[1]}]
set_load -max 1.39035  [get_nets {regs/opa_sel[0]}]
set_load -min 1.18679  [get_nets {regs/opa_sel[0]}]
set_load -max 3.30595  [get_nets {regs/opb_sel[1]}]
set_load -min 2.82039  [get_nets {regs/opb_sel[1]}]
set_load -max 3.58271  [get_nets {regs/opb_sel[0]}]
set_load -min 3.05261  [get_nets {regs/opb_sel[0]}]
set_load -max 8.90883  [get_nets {regs/opa[7]}]
set_load -min 7.54814  [get_nets {regs/opa[7]}]
set_load -max 10.0005  [get_nets {regs/opa[6]}]
set_load -min 8.43247  [get_nets {regs/opa[6]}]
set_load -max 9.18359  [get_nets {regs/opa[5]}]
set_load -min 7.74913  [get_nets {regs/opa[5]}]
set_load -max 7.01971  [get_nets {regs/opa[4]}]
set_load -min 5.92858  [get_nets {regs/opa[4]}]
set_load -max 5.08046  [get_nets {regs/opa[3]}]
set_load -min 4.27771  [get_nets {regs/opa[3]}]
set_load -max 5.20306  [get_nets {regs/opa[2]}]
set_load -min 4.40121  [get_nets {regs/opa[2]}]
set_load -max 5.03028  [get_nets {regs/opa[1]}]
set_load -min 4.23516  [get_nets {regs/opa[1]}]
set_load -max 5.28108  [get_nets {regs/opa[0]}]
set_load -min 4.44725  [get_nets {regs/opa[0]}]
set_load -max 9.78523  [get_nets {regs/opb[7]}]
set_load -min 8.29277  [get_nets {regs/opb[7]}]
set_load -max 8.64944  [get_nets {regs/opb[6]}]
set_load -min 7.30369  [get_nets {regs/opb[6]}]
set_load -max 6.24307  [get_nets {regs/opb[5]}]
set_load -min 5.3308  [get_nets {regs/opb[5]}]
set_load -max 6.80115  [get_nets {regs/opb[4]}]
set_load -min 5.80478  [get_nets {regs/opb[4]}]
set_load -max 5.73041  [get_nets {regs/opb[3]}]
set_load -min 4.87413  [get_nets {regs/opb[3]}]
set_load -max 4.92028  [get_nets {regs/opb[2]}]
set_load -min 4.1631  [get_nets {regs/opb[2]}]
set_load -max 6.64283  [get_nets {regs/opb[1]}]
set_load -min 5.60095  [get_nets {regs/opb[1]}]
set_load -max 4.65921  [get_nets {regs/opb[0]}]
set_load -min 3.93006  [get_nets {regs/opb[0]}]
set_load -max 11.8938  [get_nets {regs/pc[7]}]
set_load -min 10.1598  [get_nets {regs/pc[7]}]
set_load -max 10.7758  [get_nets {regs/pc[6]}]
set_load -min 9.19756  [get_nets {regs/pc[6]}]
set_load -max 9.54383  [get_nets {regs/pc[5]}]
set_load -min 8.17937  [get_nets {regs/pc[5]}]
set_load -max 9.98406  [get_nets {regs/pc[4]}]
set_load -min 8.5576  [get_nets {regs/pc[4]}]
set_load -max 13.8495  [get_nets {regs/pc[3]}]
set_load -min 11.8281  [get_nets {regs/pc[3]}]
set_load -max 12.9461  [get_nets {regs/pc[2]}]
set_load -min 11.0218  [get_nets {regs/pc[2]}]
set_load -max 15.4678  [get_nets {regs/pc[1]}]
set_load -min 13.132  [get_nets {regs/pc[1]}]
set_load -max 14.3077  [get_nets {regs/pc[0]}]
set_load -min 12.1767  [get_nets {regs/pc[0]}]
set_load -max 7.55598  [get_nets regs/net385]
set_load -min 6.5929  [get_nets regs/net385]
set_resistance 4.22803e-05  [get_nets regs/net385]
set_load -max 7.13355  [get_nets regs/net375]
set_load -min 6.25564  [get_nets regs/net375]
set_resistance 4.26684e-05  [get_nets regs/net375]
set_load -max 7.40061  [get_nets regs/net370]
set_load -min 6.31654  [get_nets regs/net370]
set_resistance 4.44881e-05  [get_nets regs/net370]
set_load -max 5.18848  [get_nets regs/net365]
set_load -min 4.5757  [get_nets regs/net365]
set_resistance 3.05718e-05  [get_nets regs/net365]
set_load -max 1.00858  [get_nets mcu/clk_G1B2I1]
set_load -min 0.893352  [get_nets mcu/clk_G1B2I1]
set_resistance 7.54875e-06  [get_nets mcu/clk_G1B2I1]
set_load -max 0.740626  [get_nets mcu/clk_G1B1I1]
set_load -min 0.649912  [get_nets mcu/clk_G1B1I1]
set_resistance 4.84875e-06  [get_nets mcu/clk_G1B1I1]
set_load -max 0.74289  [get_nets mcu/state_0_]
set_load -min 0.628975  [get_nets mcu/state_0_]
set_load -max 0.731215  [get_nets mcu/N30]
set_load -min 0.623558  [get_nets mcu/N30]
set_load -max 0.928473  [get_nets mcu/N104]
set_load -min 0.784753  [get_nets mcu/N104]
set_load -max 3.6611  [get_nets mcu/N105]
set_load -min 3.10585  [get_nets mcu/N105]
set_load -max 0.391543  [get_nets mcu/N106]
set_load -min 0.334826  [get_nets mcu/N106]
set_load -max 0.388479  [get_nets mcu/N107]
set_load -min 0.331732  [get_nets mcu/N107]
set_load -max 2.21944  [get_nets mcu/N123]
set_load -min 1.88417  [get_nets mcu/N123]
set_load -max 2.47639  [get_nets mcu/n42]
set_load -min 2.11224  [get_nets mcu/n42]
set_load -max 0.931436  [get_nets mcu/n43]
set_load -min 0.783518  [get_nets mcu/n43]
set_load -max 0.830753  [get_nets mcu/n2]
set_load -min 0.69802  [get_nets mcu/n2]
set_load -max 4.54914  [get_nets mcu/n3]
set_load -min 3.8488  [get_nets mcu/n3]
set_load -max 0.766169  [get_nets mcu/n6]
set_load -min 0.651755  [get_nets mcu/n6]
set_load -max 1.4028  [get_nets mcu/n7]
set_load -min 1.18482  [get_nets mcu/n7]
set_load -max 0.86755  [get_nets mcu/n9]
set_load -min 0.734724  [get_nets mcu/n9]
set_load -max 0.625083  [get_nets mcu/n10]
set_load -min 0.524719  [get_nets mcu/n10]
set_load -max 0.337169  [get_nets mcu/n11]
set_load -min 0.284209  [get_nets mcu/n11]
set_load -max 0.797068  [get_nets mcu/n12]
set_load -min 0.676009  [get_nets mcu/n12]
set_load -max 1.23917  [get_nets mcu/n13]
set_load -min 1.04907  [get_nets mcu/n13]
set_load -max 4.01744  [get_nets mcu/n14]
set_load -min 3.40143  [get_nets mcu/n14]
set_load -max 1.52763  [get_nets mcu/n15]
set_load -min 1.304  [get_nets mcu/n15]
set_load -max 2.37777  [get_nets mcu/n16]
set_load -min 2.00401  [get_nets mcu/n16]
set_load -max 1.47423  [get_nets mcu/n17]
set_load -min 1.25112  [get_nets mcu/n17]
set_load -max 0.874475  [get_nets mcu/n18]
set_load -min 0.742313  [get_nets mcu/n18]
set_load -max 0.771848  [get_nets mcu/n19]
set_load -min 0.653588  [get_nets mcu/n19]
set_load -max 1.12919  [get_nets mcu/n20]
set_load -min 0.960923  [get_nets mcu/n20]
set_load -max 2.07701  [get_nets mcu/n21]
set_load -min 1.76831  [get_nets mcu/n21]
set_load -max 1.46431  [get_nets mcu/n22]
set_load -min 1.24929  [get_nets mcu/n22]
set_load -max 1.75305  [get_nets mcu/n23]
set_load -min 1.49146  [get_nets mcu/n23]
set_load -max 0.872261  [get_nets mcu/n24]
set_load -min 0.746172  [get_nets mcu/n24]
set_load -max 3.00345  [get_nets mcu/n25]
set_load -min 2.56142  [get_nets mcu/n25]
set_load -max 1.33015  [get_nets mcu/n26]
set_load -min 1.11516  [get_nets mcu/n26]
set_load -max 0.532357  [get_nets mcu/n27]
set_load -min 0.457597  [get_nets mcu/n27]
set_load -max 4.51683  [get_nets mcu/n29]
set_load -min 3.82015  [get_nets mcu/n29]
set_load -max 1.48497  [get_nets mcu/n30]
set_load -min 1.25041  [get_nets mcu/n30]
set_load -max 6.45153  [get_nets mcu/n31]
set_load -min 5.47812  [get_nets mcu/n31]
set_load -max 3.30595  [get_nets {mcu/alu_opb_sel[1]}]
set_load -min 2.82039  [get_nets {mcu/alu_opb_sel[1]}]
set_load -max 3.58271  [get_nets {mcu/alu_opb_sel[0]}]
set_load -min 3.05261  [get_nets {mcu/alu_opb_sel[0]}]
set_load -max 16.4165  [get_nets mcu/pc_load]
set_load -min 13.9233  [get_nets mcu/pc_load]
set_load -max 24.1137  [get_nets mcu/rst]
set_load -min 20.5321  [get_nets mcu/rst]
set_load -max 26.2003  [get_nets mcu/clk]
set_load -min 22.8673  [get_nets mcu/clk]
set_resistance 0.000132744  [get_nets mcu/clk]
set_load -max 21.6211  [get_nets mcu/dmem_write]
set_load -min 18.3165  [get_nets mcu/dmem_write]
set_load -max 15.2776  [get_nets mcu/pc_count_BAR]
set_load -min 13.0412  [get_nets mcu/pc_count_BAR]
set_load -max 1.9716  [get_nets mcu/opcode_update]
set_load -min 1.67547  [get_nets mcu/opcode_update]
set_load -max 1.03013  [get_nets {mcu/opcode[7]}]
set_load -min 0.882642  [get_nets {mcu/opcode[7]}]
set_load -max 3.19049  [get_nets {mcu/opcode[6]}]
set_load -min 2.71459  [get_nets {mcu/opcode[6]}]
set_load -max 0.448847  [get_nets {mcu/opcode[5]}]
set_load -min 0.385635  [get_nets {mcu/opcode[5]}]
set_load -max 0.756258  [get_nets {mcu/opcode[4]}]
set_load -min 0.648872  [get_nets {mcu/opcode[4]}]
set_load -max 0.882508  [get_nets {mcu/opcode[3]}]
set_load -min 0.754436  [get_nets {mcu/opcode[3]}]
set_load -max 2.33056  [get_nets {mcu/opcode[2]}]
set_load -min 1.98258  [get_nets {mcu/opcode[2]}]
set_load -max 5.03753  [get_nets {mcu/opcode[1]}]
set_load -min 4.28379  [get_nets {mcu/opcode[1]}]
set_load -max 5.9602  [get_nets {mcu/opcode[0]}]
set_load -min 5.06125  [get_nets {mcu/opcode[0]}]
set_load -max 0.578995  [get_nets mcu/psr_update]
set_load -min 0.486406  [get_nets mcu/psr_update]
set_load -max 10.0273  [get_nets {mcu/psr[2]}]
set_load -min 8.54099  [get_nets {mcu/psr[2]}]
set_load -max 5.12838  [get_nets {mcu/psr[1]}]
set_load -min 4.34945  [get_nets {mcu/psr[1]}]
set_load -max 8.58661  [get_nets {mcu/psr[0]}]
set_load -min 7.30385  [get_nets {mcu/psr[0]}]
set_load -max 9.38179  [get_nets mcu/res_update]
set_load -min 7.98266  [get_nets mcu/res_update]
set_load -max 1.56702  [get_nets {mcu/res_sel[1]}]
set_load -min 1.32001  [get_nets {mcu/res_sel[1]}]
set_load -max 1.09228  [get_nets {mcu/res_sel[0]}]
set_load -min 0.918782  [get_nets {mcu/res_sel[0]}]
set_load -max 17.6483  [get_nets {mcu/alu_operation[3]}]
set_load -min 14.9457  [get_nets {mcu/alu_operation[3]}]
set_load -max 9.61249  [get_nets {mcu/alu_operation[2]}]
set_load -min 8.15214  [get_nets {mcu/alu_operation[2]}]
set_load -max 6.00572  [get_nets {mcu/alu_operation[1]}]
set_load -min 5.09329  [get_nets {mcu/alu_operation[1]}]
set_load -max 5.27972  [get_nets {mcu/alu_operation[0]}]
set_load -min 4.46418  [get_nets {mcu/alu_operation[0]}]
set_load -max 2.02455  [get_nets {mcu/alu_opa_sel[1]}]
set_load -min 1.71853  [get_nets {mcu/alu_opa_sel[1]}]
set_load -max 1.39035  [get_nets {mcu/alu_opa_sel[0]}]
set_load -min 1.18679  [get_nets {mcu/alu_opa_sel[0]}]
set_load -max 4.71332  [get_nets pc/clk_gate_addr_out_reg/net344]
set_load -min 4.02611  [get_nets pc/clk_gate_addr_out_reg/net344]
set_load -max 0.941673  [get_nets pc/clk_gate_addr_out_reg/n1]
set_load -min 0.812641  [get_nets pc/clk_gate_addr_out_reg/n1]
set_resistance 5.25375e-06  [get_nets pc/clk_gate_addr_out_reg/n1]
set_load -max 26.2003  [get_nets pc/clk_gate_addr_out_reg/CLK]
set_load -min 22.8673  [get_nets pc/clk_gate_addr_out_reg/CLK]
set_resistance 0.000132744  [get_nets pc/clk_gate_addr_out_reg/CLK]
set_load -max 0.622826  [get_nets pc/clk_gate_addr_out_reg/EN]
set_load -min 0.5316  [get_nets pc/clk_gate_addr_out_reg/EN]
set_load -max 11.9227  [get_nets pc/clk_gate_addr_out_reg/ENCLK]
set_load -min 10.3004  [get_nets pc/clk_gate_addr_out_reg/ENCLK]
set_resistance 7.11169e-05  [get_nets pc/clk_gate_addr_out_reg/ENCLK]
set_load -max 11.2963  [get_nets regs/clk_gate_acc_reg/net359]
set_load -min 9.54139  [get_nets regs/clk_gate_acc_reg/net359]
set_load -max 3.12211  [get_nets regs/clk_gate_acc_reg/n2]
set_load -min 2.72353  [get_nets regs/clk_gate_acc_reg/n2]
set_resistance 1.56938e-05  [get_nets regs/clk_gate_acc_reg/n2]
set_load -max 26.2003  [get_nets regs/clk_gate_acc_reg/CLK]
set_load -min 22.8673  [get_nets regs/clk_gate_acc_reg/CLK]
set_resistance 0.000132744  [get_nets regs/clk_gate_acc_reg/CLK]
set_load -max 9.38179  [get_nets regs/clk_gate_acc_reg/EN]
set_load -min 7.98266  [get_nets regs/clk_gate_acc_reg/EN]
set_load -max 7.55598  [get_nets regs/clk_gate_acc_reg/ENCLK]
set_load -min 6.5929  [get_nets regs/clk_gate_acc_reg/ENCLK]
set_resistance 4.22803e-05  [get_nets regs/clk_gate_acc_reg/ENCLK]
set_load -max 3.56807  [get_nets regs/clk_gate_imem_reg/net359]
set_load -min 3.03023  [get_nets regs/clk_gate_imem_reg/net359]
set_load -max 1.28689  [get_nets regs/clk_gate_imem_reg/n2]
set_load -min 1.11546  [get_nets regs/clk_gate_imem_reg/n2]
set_resistance 7.32054e-06  [get_nets regs/clk_gate_imem_reg/n2]
set_load -max 26.2003  [get_nets regs/clk_gate_imem_reg/CLK]
set_load -min 22.8673  [get_nets regs/clk_gate_imem_reg/CLK]
set_resistance 0.000132744  [get_nets regs/clk_gate_imem_reg/CLK]
set_load -max 15.2776  [get_nets regs/clk_gate_imem_reg/EN]
set_load -min 13.0412  [get_nets regs/clk_gate_imem_reg/EN]
set_load -max 7.13355  [get_nets regs/clk_gate_imem_reg/ENCLK]
set_load -min 6.25564  [get_nets regs/clk_gate_imem_reg/ENCLK]
set_resistance 4.26684e-05  [get_nets regs/clk_gate_imem_reg/ENCLK]
set_load -max 7.13588  [get_nets regs/clk_gate_psr_reg/net359]
set_load -min 6.0884  [get_nets regs/clk_gate_psr_reg/net359]
set_load -max 0.776702  [get_nets regs/clk_gate_psr_reg/n2]
set_load -min 0.67955  [get_nets regs/clk_gate_psr_reg/n2]
set_resistance 4.28464e-06  [get_nets regs/clk_gate_psr_reg/n2]
set_load -max 26.2003  [get_nets regs/clk_gate_psr_reg/CLK]
set_load -min 22.8673  [get_nets regs/clk_gate_psr_reg/CLK]
set_resistance 0.000132744  [get_nets regs/clk_gate_psr_reg/CLK]
set_load -max 0.578995  [get_nets regs/clk_gate_psr_reg/EN]
set_load -min 0.486406  [get_nets regs/clk_gate_psr_reg/EN]
set_load -max 7.40061  [get_nets regs/clk_gate_psr_reg/ENCLK]
set_load -min 6.31654  [get_nets regs/clk_gate_psr_reg/ENCLK]
set_resistance 4.44881e-05  [get_nets regs/clk_gate_psr_reg/ENCLK]
set_load -max 2.67722  [get_nets regs/clk_gate_opcode_reg/net359]
set_load -min 2.27223  [get_nets regs/clk_gate_opcode_reg/net359]
set_load -max 1.33928  [get_nets regs/clk_gate_opcode_reg/n1]
set_load -min 1.16893  [get_nets regs/clk_gate_opcode_reg/n1]
set_resistance 7.74e-06  [get_nets regs/clk_gate_opcode_reg/n1]
set_load -max 26.2003  [get_nets regs/clk_gate_opcode_reg/CLK]
set_load -min 22.8673  [get_nets regs/clk_gate_opcode_reg/CLK]
set_resistance 0.000132744  [get_nets regs/clk_gate_opcode_reg/CLK]
set_load -max 1.9716  [get_nets regs/clk_gate_opcode_reg/EN]
set_load -min 1.67547  [get_nets regs/clk_gate_opcode_reg/EN]
set_load -max 5.18848  [get_nets regs/clk_gate_opcode_reg/ENCLK]
set_load -min 4.5757  [get_nets regs/clk_gate_opcode_reg/ENCLK]
set_resistance 3.05718e-05  [get_nets regs/clk_gate_opcode_reg/ENCLK]
